In [1]:
import pandas as pd

data = {
    'id':[1,2,3,],
    'name' : ['Choi', 'Lee', 'Kim'],
    'age' : [10,20,30],
    'assets' : [150.4, 123.4, 88.88]
}

In [2]:
df = pd.DataFrame(data)

In [7]:
df['id']

0    1
1    2
2    3
Name: id, dtype: int64

In [6]:
df.ix[0]

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

id            1
name       Choi
age          10
assets    150.4
Name: 0, dtype: object

In [9]:
# del // drop
df.drop('id', axis=1)

   name  age  assets
0  Choi   10  150.40
1   Lee   20  123.40
2   Kim   30   88.88

In [10]:
df.drop(0)

   id name  age  assets
1   2  Lee   20  123.40
2   3  Kim   30   88.88

In [12]:
df.index = df['id']
df = df.drop('id', axis=1)
df

    name  age  assets
id
1   Choi   10  150.40
2    Lee   20  123.40
3    Kim   30   88.88

In [13]:
df.iloc[0]

name       Choi
age          10
assets    150.4
Name: 1, dtype: object

In [17]:
df.loc[4] = ['Hong', 23, 15.80]

In [18]:
df

    name  age  assets
id
1   Choi   10  150.40
2    Lee   20  123.40
3    Kim   30   88.88
4   Hong   23   15.80

In [19]:
df.T

id          1      2      3     4
name     Choi    Lee    Kim  Hong
age        10     20     30    23
assets  150.4  123.4  88.88  15.8

In [20]:
df_temp = df.T

In [21]:
df_temp

id          1      2      3     4
name     Choi    Lee    Kim  Hong
age        10     20     30    23
assets  150.4  123.4  88.88  15.8

In [22]:
df.values

array([['Choi', 10, 150.4],
       ['Lee', 20, 123.4],
       ['Kim', 30, 88.88],
       ['Hong', 23, 15.8]], dtype=object)